app/controllers/books_controller.rb

  def index
  @books = Book.where(availability: true)
---
SELECT "books".* FROM "books" WHERE "books"."availability" = 't'